src/srm_client/templates/DestroyPropertyCollector.xml

<soap:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <DestroyPropertyCollector xmlns="urn:internaldr0">
      <_this xmlns:internalvim25="urn:internalvim25" xsi:type="internalvim25:ManagedObjectReference" type="PropertyCollector">{{ key }}</_this>
    </DestroyPropertyCollector>
  </soap:Body>
</soap:Envelope>
